var ParentVocation = [["1~12", "IT"], ["13~14", "法律"], ["15~25", "专业咨询、服务"], ["26~34", "医疗与健康"], ["35~45", "媒体"], ["46~52", "体育、休闲、旅游、娱乐"], ["53~60", "金融"], ["61~64", "非盈利性组织"], ["65~68", "教育"], ["69~82", "日常消费品"], ["83~87", "建筑"], ["88~104", "制造"], ["105~113", "政府及公共事业"], ["114~119", "公共服务业"], ["120~126", "交通运输"], ["127~133", "农林牧渔业"], ["134~134", "其他行业"]];

var Vocation = [["1", "空间科技"], ["2", "计算机硬件"], ["3", "计算机软件"], ["4", "计算机网络设备"], ["5", "计算机&网络安全"], ["6", "计算机游戏"], ["7", "互联网"], ["8", "半导体"], ["9", "电信&通讯"], ["10", "纳米技术"], ["11", "信息技术与服务"], ["12", "无线通讯"], ["13", "法律援助"], ["14", "法律服务"], ["15", "管理咨询"], ["16", "招聘、猎头"], ["17", "人力资源"], ["18", "培训"], ["19", "市场推广&广告"], ["20", "市场调研"], ["21", "公共关系"], ["22", "翻译服务"], ["23", "设备维护"], ["24", "外包服务"], ["25", "会务及活动服务"], ["26", "生物工程"], ["27", "生物信息"], ["28", "医院&医疗"], ["29", "医药品"], ["30", "医疗设备"], ["31", "兽医"], ["32", "健身"], ["33", "心理健康"], ["34", "中医"], ["35", "广播"], ["36", "电视"], ["37", "电影"], ["38", "报纸"], ["39", "杂志"], ["40", "出版"], ["41", "写作&编辑"], ["42", "文化艺术"], ["43", "印刷"], ["44", "互联网媒体"], ["45", "媒体设计制作"], ["46", "娱乐业"], ["47", "休闲度假&旅游"], ["48", "餐饮业"], ["49", "住宿业"], ["50", "体育运动"], ["51", "食品&饮料"], ["52", "娱乐设备与服务"], ["53", "保险"], ["54", "财经服务"], ["55", "房地产"], ["56", "投资银行"], ["57", "风险投资"], ["58", "私募股权投资"], ["59", "证券"], ["60", "会计"], ["61", "非盈利性组织管理"], ["62", "公益基金"], ["63", "智囊团"], ["64", "慈善事业"], ["65", "义务教育"], ["66", "高等教育"], ["67", "教育管理"], ["68", "教育研究"], ["69", "化妆品"], ["70", "服装服饰"], ["71", "体育用品"], ["72", "烟草"], ["73", "超市卖场"], ["74", "食物生产"], ["75", "酒类"], ["76", "消费电子"], ["77", "快速消费品"], ["78", "家具"], ["79", "零售"], ["80", "批发"], ["81", "进出口"], ["82", "奢侈品&珠宝"], ["83", "建筑工程"], ["84", "建材"], ["85", "建筑设计"], ["86", "土木工程"], ["87", "装饰装潢"], ["88", "工艺品"], ["89", "飞行航空&宇航"], ["90", "汽车"], ["91", "化工"], ["92", "电子电气设备"], ["93", "机械"], ["94", "采矿&金属"], ["95", "石油&能源"], ["96", "回收&环境保护"], ["97", "造船"], ["98", "纺织及皮革制造"], ["99", "造纸&木材"], ["100", "铁路"], ["101", "玻璃,陶瓷&混凝土"], ["102", "包装&集装箱"], ["103", "工业管理"], ["104", "工业自动化"], ["105", "军事机构"], ["106", "司法机关"], ["107", "外交"], ["108", "行政部门"], ["109", "卫生社会福利社会保障"], ["110", "水利环境公共设施"], ["111", "地址勘探"], ["112", "水电燃气生产供应"], ["113", "公共安全"], ["114", "信息服务"], ["115", "图书馆及博物馆"], ["116", "保安服务"], ["117", "环保服务"], ["118", "家政服务"], ["119", "宗教协会"], ["120", "邮政，包裹，零担货运"], ["121", "物流与供应链"], ["122", "运输/汽运/铁路"], ["123", "仓储"], ["124", "航空运输"], ["125", "水上运输"], ["126", "客运及城市公共交通"], ["127", "渔业"], ["128", "林业"], ["129", "农场"], ["130", "畜牧"], ["131", "商品贸易"], ["132", "国内贸易"], ["133", "国际贸易"], ["134", "其他行业"]];

var main_menu=[["1","移动开发"],["2","前端开发"],["3","后端开发"],["4","数据库"],["5","云计算/大数据"],["6","算法及应用"],["7","运维"],["8","测试"],["9","企业软件"],["10","电子"],["11","管理"],["12","其他"]];

var second_menu=[["1","1","IOS"],["1","2","Android"],["1","3","WP"],["2","4","Web前端"],["2","5","HTML5"],["2","6","JavaScript"],["2","7","HTML"],["2","8","Flash"],["3","9","Java"],["3","10","PHP"],["3","11","C++"],["3","12","C#"],["3","13","Ruby"],["3","14","Python"],["3","15","VB"],["3","16","Node.js"],["3","17","Perl"],["3","18","Go"],["3","19","Delphi"],["4","20","MySQL"],["4","21","Oracle"],["4","22","SqlServer"],["4","23","MongoDB"],["4","24","DB2"],["4","25","ETL"],["4","26","NoSQL"],["5","27","Hadoop"],["5","28","Yarn"],["5","29","Spark"],["5","30","云存储"],["5","31","虚拟化"],["5","32","IaaS"],["5","33","PaaS"],["5","34","SaaS"],["5","35","Hive"],["6","36","广告算法"],["6","37","图像梳理算法"],["6","38","推荐算法"],["6","39","数据挖掘"],["6","40","机器学习"],["6","41","自然语言处理"],["6","42","搜索引擎"],["6","43","用户行为分析"],["6","44","商业智能"],["6","45","数据仓库"],["6","46","决策支持(DSS)"],["6","47","在线分析处理(OLAP)"],["7","48","运维工程师"],["7","49","网络工程师"],["7","50","系统工程师"],["7","51","安全工程师"],["7","52","Web安全"],["7","53","网络安全"],["7","54","系统安全"],["7","55","IT支持"],["7","56","IDC"],["7","57","CDN"],["8","58","测试工程师"],["8","59","自动化测试"],["8","60","功能测试"],["8","61","性能测试"],["8","62","游戏测试"],["8","63","移动应用App测试"],["8","64","Web测试"],["8","65","手机测试"],["8","66","IC测试"],["8","67","硬件测试"],["8","68","系统测试"],["8","69","白盒测试"],["8","70","黑盒测试"],["8","71","灰盒测试"],["9","72","软件产品开发"],["9","73","软件产品实施"],["9","74","售前工程师"],["9","75","售后支持工程师"],["9","76","系统集成工程师"],["9","77","配置管理"],["10","78","IC设计"],["10","79","PCB布线"],["10","80","MCU开发"],["10","81","DSP开发"],["10","82","FPGA开发"],["10","83","电气线路"],["10","84","电源设计"],["10","85","无线射频"],["10","86","通信协议"],["10","87","驱动开发"],["10","88","系统设计及集成"],["10","89","嵌入式开发"],["10","90","工艺工程"],["10","91","FAE/AE"],["11","92","项目经理"],["11","93","测试经理"],["11","94","运维经理"],["11","95","安全专家"],["11","96","系统架构师"],["12","97","产品经理"],["12","98","UI/UE"],["12","99","其它行业"]];

var $p = {}; //公共参数
$p.busiType = ["未知","开发服务","咨询服务"];

// ------------------------------- OLD CODE --------------------------------------------
function getVocationValue(vId){
	if(isNaN(vId)){
		return;
	}
	var i1 = parseInt(vId);
	var _vocation = Vocation[i1-1][1];
	var pId;
	if(i1<=12){
		pId = 0;
	}else if(i1<=14){
		pId = 1;
	}else if(i1<=25){
		pId = 2;
	}else if(i1<=34){
		pId = 3;
	}else if(i1<=45){
		pId = 4;
	}else if(i1<=52){
		pId = 5;
	}else if(i1<=60){
		pId = 6;
	}else if(i1<=64){
		pId = 7;
	}else if(i1<=68){
		pId = 8;
	}else if(i1<=82){
		pId = 9;
	}else if(i1<=87){
		pId = 10;
	}else if(i1<=104){
		pId = 11;
	}else if(i1<=113){
		pId = 12;
	}else if(i1<=119){
		pId = 13;
	}else if(i1<=126){
		pId = 14;
	}else if(i1<=133){
		pId = 15;
	}else if(i1<=134){
		pId = 16;
	}
	var _pVocation = ParentVocation[pId][1];
	return {parentVocation:_pVocation,vocation:_vocation,pId:ParentVocation[pId][0]};
}

function getJob(vId){
//	console.log(vId);
	if(isNaN(vId)||vId==undefined||vId==null){
		return {main_job:'vocation.js',sub_job:'line:59[test]'};
	}
	
	if(parseInt(vId)<1){
		vId = "1";
	}
	var _subBusiType = second_menu[parseInt(vId)-1];
//	console.log(_subBusiType);
	var _busiType = main_menu[parseInt(_subBusiType[0])-1][1];
	return {main_job:_busiType,sub_job:_subBusiType[2],pId:main_menu[parseInt(_subBusiType[0])-1][0]}
}